Revit 2026 API

# FailureDefinitionId Properties

---

The FailureDefinitionId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Guid | The Guid of GUID-based enum object. (Inherited from GuidEnum) |

#### Reference

FailureDefinitionId Class

Autodesk.Revit.DB Namespace